<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
<TITLE> New Document </TITLE>
<META NAME="Keywords" CONTENT="Tak-Wai Chan">
<link rel=stylesheet type="text/css" href="styles.css">
</HEAD>

<BODY>
<H2>陳德懷 </H2>
<H2 align="center">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
<a href="http://chancircle.lst.ncu.edu.tw/"target="_blank">
<img border="0" src="chancircle3.gif" width="100" height="50"></a></H2>
<table width="70%" align="center">
<tr>
<td>
<P>
<span style="font-family: 新細明體">
<a href="http://chan.lst.ncu.edu.tw/chan.jpg"><IMG SRC="chan.jpg" ALT="Prof. Chan's picture" width="130" height="183" hspace=20 BORDER=0 align=left></a></span></p>
<p class="MsoNormal" style="text-align: justify; text-justify: inter-ideograph; text-indent: 24.0pt; line-height: 18.0pt; layout-grid-mode: char;"> &#38515;&#24503;&#25079;&#25945;&#25480;&#30446;&#21069;&#26159;&#33274;&#28771;&#30340;&#20013;&#22830;&#22823;&#23416;&#32178;&#36335;&#23416;&#32722;&#31185;&#25216;&#30740;&#31350;&#25152;&#25152;&#38263;&#12290;&#20182;&#30340;&#30740;&#31350;&#27243;&#36328;&#24190;&#20491;&#37325;&#35201;&#30340;&#25976;&#20301;&#23416;&#32722;&#23376;&#38936;&#22495;&#65292;&#33258;&#12300;&#20154;&#24037;&#26234;&#24935;&#22312;&#25945;&#32946;&#30340;&#25033;&#29992;&#12301;&#38283;&#22987;&#65292;&#24310;&#20280;&#21040;&#12300;&#38651;&#33126;&#36628;&#21161;&#21512;&#20316;&#23416;&#32722;&#12301;&#65292;&#24460;&#20358;&#30740;&#31350;&#12300;&#32178;&#36335;&#23416;&#32722;&#31038;&#32676;&#12301;&#65292;&#36817;&#24180;&#21063;&#29305;&#21029;&#38364;&#27880;&#12300;&#34892;&#21205;&#33287;&#28961;&#25152;&#19981;&#22312;&#23416;&#32722;&#12301;&#33287;&#12300;&#36938;&#25138;&#24335;&#25976;&#20301;&#23416;&#32722;&#12301;&#30340;&#30740;&#31350;&#12290;&#38614;&#28982;&#30740;&#31350;&#31684;&#22285;&#24456;&#24291;&#65292;&#20294;&#20182;&#38263;&#26399;&#25506;&#35342;&#30340;&#30740;&#31350;&#20027;&#38988;&#26377;&#19977;&#38917;&#12290;&#39318;&#20808;&#26159;&#12300;&#23416;&#32722;&#21516;&#20276;&#12301;&#30340;&#21839;&#38988;&#65292;&#27492;&#27010;&#24565;&#20418;&#30001;&#20182;&#22312;1988&#24180;&#30332;&#34920;&#65292;&#26159;&#21338;&#22763;&#35542;&#25991;&#20013;&#30340;&#19968;&#37096;&#20998;&#12290;&#21407;&#20358;&#26234;&#24935;&#22411;&#25351;&#23566;&#31995;&#32113;&#35430;&#22294;&#25552;&#20379;&#19968;&#38917;&#26032;&#30340;&#20839;&#28085;&#65292;&#35442;&#38917;&#30740;&#31350;&#24037;&#20316;&#38568;&#24460;&#24478;&#26234;&#24935;&#22411;&#25351;&#23566;&#22402;&#30452;&#25844;&#22823;&#21040;&#21512;&#20316;&#23416;&#32722;&#21450;&#31038;&#26371;&#23416;&#32722;&#20108;&#38917;&#38936;&#22495;&#12290;&#31532;&#20108;&#38917;&#21839;&#38988;&#26159;&#30740;&#31350;&#12300;&#26234;&#24935;&#22411;&#26410;&#20358;&#25945;&#23460;&#12301;&#65292;&#36889;&#26159;&#20182;&#21040;&#33274;&#28771;&#20219;&#25945;&#24460;&#65292;&#23559;&#12300;&#23416;&#32722;&#21516;&#20276;&#12301;&#24310;&#20280;&#21040;&#25945;&#23460;&#20839;&#32178;&#36335;&#30340;&#29872;&#22659;&#12290;&#22312;1992&#24180;&#65292;&#38515;&#24503;&#25079;&#21644;&#20182;&#30340;&#21516;&#20698;&#30332;&#34920;&#20840;&#19990;&#30028;&#26368;&#26089;&#30340;&#23560;&#29992;&#21516;&#27493;&#65288;&#21363;&#26178;&#65289;&#32178;&#36335;&#21512;&#20316;&#33287;&#31478;&#29229;&#24335;&#36938;&#25138;&#23416;&#32722;&#31995;&#32113;&#65292;&#31281;&#28858;&#12300;&#20998;&#25955;&#24335;WEST&#12301;&#65292;&#35442;&#21407;&#22411;&#20134;&#28858;&#30740;&#31350;&#25945;&#23460;&#20013;&#20197;&#38651;&#33126;&#28858;&#20013;&#20171;&#38754;&#23565;&#38754;&#20114;&#21205;&#23416;&#32722;&#30340;&#26368;&#26089;&#30740;&#31350;&#26696;&#20363;&#31995;&#32113;&#20043;&#19968;&#12290;&#31532;&#19977;&#38917;&#21839;&#38988;&#26159;&#30740;&#31350;&#22823;&#22411;&#12300;&#32178;&#36335;&#23416;&#32722;&#31038;&#32676;&#12301;&#22914;&#20309;&#24314;&#31435;&#33287;&#20114;&#21205;&#65292;&#22312;2000&#24180;&#65292;&#38515;&#24503;&#25079;&#25104;&#31435;&#20102;&#20840;&#29699;&#31532;&#19968;&#20491;&#32178;&#36335;&#23416;&#32722;&#22478;&#24066;&#12300;&#20126;&#21331;&#24066;&#12301;&#12290;<br>
</p>
<p class="MsoNormal" style="text-align: justify; text-justify: inter-ideograph; text-indent: 24.0pt; line-height: 18.0pt; layout-grid-mode: char;">&#12300;&#23416;&#32722;&#21516;&#20276;&#12301;&#30740;&#31350;&#33258;&#30332;&#34920;&#24460;&#21313;&#22810;&#24180;&#20358;&#65292;&#25345;&#32396;&#29554;&#24471;&#22283;&#38555;&#24291;&#27867;&#30340;&#38364;&#27880;&#12290;&#30001;&#26044;&#35442;&#38936;&#22495;&#30740;&#31350;&#21644;&#25216;&#34899;&#30340;&#36914;&#27493;&#65292;&#33268;&#20351;&#38515;&#24503;&#25079;&#25945;&#25480;&#35430;&#22294;&#28858;&#12300;&#32066;&#36523;&#23416;&#32722;&#21516;&#20276;&#12301;&#30740;&#31350;&#24314;&#31435;&#20986;&#27010;&#24565;&#21644;&#21407;&#22411;&#30340;&#22522;&#30990;&#12290;&#23565;&#26234;&#24935;&#22411;&#26410;&#20358;&#25945;&#23460;&#32780;&#35328;&#65292;&#26032;&#33288;&#30340;&#28961;&#32218;&#34892;&#21205;&#25216;&#34899;&#33268;&#20351;&#35442;&#30740;&#31350;&#23637;&#29694;&#21069;&#25152;&#26410;&#35211;&#30340;&#21487;&#34892;&#24615;&#12290;&#20107;&#23526;&#19978;&#65292;&#26410;&#20358;&#21218;&#24517;&#20986;&#29694;&#26356;&#22810;&#30340;&#12300;&#25976;&#20301;&#25945;&#23460;&#12301;&#65292;&#21363;&#27599;&#19968;&#20301;&#23416;&#29983;&#33267;&#23569;&#25793;&#26377;&#19968;&#22871;&#21487;&#20197;&#28961;&#32218;&#19978;&#32178;&#30340;&#25976;&#20301;&#23416;&#32722;&#36628;&#20855;&#65288;&#21443;&#35211;www.g1on1.org&#65289;&#12290;&#38515;&#24503;&#25079;&#25945;&#25480;&#22312;&#36889;&#26041;&#38754;&#30340;&#30740;&#31350;&#20027;&#35201;&#22312;&#25976;&#20301;&#25945;&#23460;&#20013;&#22914;&#20309;&#36914;&#34892;&#21109;&#26032;&#23416;&#32722;&#27963;&#21205;&#35373;&#35336;&#65292;&#20197;&#38651;&#33126;&#28858;&#20013;&#20171;&#38754;&#23565;&#38754;&#20114;&#21205;&#23416;&#32722;&#25152;&#29986;&#29983;&#35920;&#23500;&#30340;&#35469;&#30693;&#12289;&#31038;&#26371;&#20114;&#21205;&#21644;&#24773;&#24863;&#31561;&#30740;&#31350;&#35696;&#38988;&#12290;<br>
    </p>
<p class="MsoNormal" style="text-align: justify; text-justify: inter-ideograph; text-indent: 24.0pt; line-height: 18.0pt; layout-grid-mode: char;">2000&#24180;&#65292;&#38515;&#24503;&#25079;&#25945;&#25480;&#25812;&#20219;&#22823;&#23416;&#23416;&#34899;&#36861;&#27714;&#21331;&#36234;&#30332;&#23637;&#35336;&#30059;&#65306;&#12300;&#20027;&#21205;&#31038;&#26371;&#23416;&#32722;&#21450;&#20854;&#25033;&#29992;- &#24478;&#21488;&#28771;&#21040;&#20840;&#19990;&#30028;&#12301;&#35336;&#30059;&#30340;&#20027;&#25345;&#20154;&#65292;&#35442;&#30740;&#31350;&#35336;&#30059;&#28858;&#26399;&#22235;&#24180;&#65292;&#32147;&#36027;&#36948;&#19968;&#21315;&#22235;&#30334;&#33836;&#32654;&#37329;&#65292;&#20849;&#26377;30&#22810;&#20301;&#25945;&#25480;&#21644;&#36229;&#36942;200&#21517;&#30740;&#31350;&#29983;&#20197;&#21450;&#23560;&#26696;&#21161;&#29702;&#30340;&#21443;&#33287;&#12290;&#35442;&#35336;&#30059;&#30740;&#31350;&#22312;&#26044;&#65292;&#26410;&#20358;&#32178;&#36335;&#31038;&#26371;&#30340;&#20027;&#21205;&#23416;&#32722;&#35696;&#38988;&#12290;&#20854;&#20013;&#12300;&#20126;&#21331;&#24066;&#12301;(http://www.educities.edu.tw)&#28858;&#20840;&#19990;&#30028;&#26368;&#22823;&#30340;&#32178;&#36335;&#23416;&#32722;&#31038;&#32676;&#20043;&#19968;&#65292;&#26377;150&#33836;&#24107;&#29983;&#21450;2,500&#20491;&#23416;&#26657;&#21443;&#33287;&#12290;&#29694;&#22312;&#38515;&#25945;&#25480;&#27491;&#36914;&#34892;&#26032;&#19968;&#20195;&#12300;&#20126;&#21331;&#24066;&#12301;&#30740;&#31350;&#20197;&#21450;&#33836;&#20154;&#32178;&#36335;&#36938;&#25138;&#12290;&#34892;&#21205;&#33287;&#28961;&#25152;&#19981;&#22312;&#30340;&#30740;&#31350;&#20063;&#26159;&#35442;&#21331;&#36234;&#35336;&#21123;&#30340;&#21478;&#19968;&#38917;&#37325;&#35201;&#25104;&#26524;&#12290;<br>
</p>
<p class="MsoNormal" style="text-align: justify; text-justify: inter-ideograph; text-indent: 24.0pt; line-height: 18.0pt; layout-grid-mode: char;">&#38515;&#24503;&#25079;&#25945;&#25480;&#22312;&#30740;&#31350;&#31038;&#32676;&#30340;&#24314;&#31435;&#65292;&#22312;&#33274;&#28771;&#12289;&#22823;&#20013;&#33775;&#22280;&#12289;&#20126;&#22826;&#22320;&#21312;&#12289;&#20840;&#19990;&#30028;&#31684;&#22285;&#37117;&#26377;&#29305;&#27530;&#30340;&#36002;&#29563;&#12290;&#20182;&#26366;&#22810;&#24180;&#25812;&#20219;&#33274;&#28771;&#22283;&#23478;&#31185;&#23416;&#22996;&#21729;&#26371;&#27492;&#38936;&#22495;&#30340;&#21484;&#38598;&#20154;&#12290;1997&#24180;&#22312;&#22823;&#20013;&#33775;&#22280;&#65292;&#38515;&#24503;&#25079;&#25945;&#25480;&#33287;&#20854;&#20182;&#33775;&#20154;&#23416;&#32773;&#21109;&#36774;&#12300;&#20840;&#29699;&#33775;&#20154;&#35336;&#31639;&#27231;&#25945;&#32946;&#25033;&#29992;&#22823;&#26371;&#12301;(GCCCE)&#65292;&#35442;&#26371;&#35696;&#26366;&#26044;&#24291;&#24030;&#12289;&#39321;&#28207;&#12289;&#28595;&#38272;&#12289;&#26032;&#21152;&#22369;&#12289;&#21488;&#28771;&#65292;&#21271;&#20140;&#12289;&#21335;&#20140;&#21450;&#22799;&#23041;&#22839;&#33289;&#34892;&#12290;&#28192;&#20134;&#28858;&#12300;&#20840;&#29699;&#33775;&#20154;&#35336;&#31639;&#27231;&#36628;&#21161;&#25945;&#32946;&#23416;&#26371;&#12301;(GCSCE, www.gcsce.org)&#30340;&#26371;&#35696;&#20027;&#24109;&#65292;&#35442;&#26371;&#35696;&#20027;&#35201;&#26159;&#36000;&#36012;&#32068;&#32340;&#12300;&#20840;&#29699;&#33775;&#20154;&#35336;&#31639;&#27231;&#25945;&#32946;&#25033;&#29992;&#22823;&#26371;&#12301;(GCCCE)&#33287;&#12300;&#20840;&#29699;&#33775;&#20154;&#35336;&#31639;&#27231;&#25945;&#32946;&#26399;&#21002;&#12301;(GCJCE)&#12290;<br>
</p>
<p class="MsoNormal" style="text-align: justify; text-justify: inter-ideograph; text-indent: 24.0pt; line-height: 18.0pt; layout-grid-mode: char;">&#22312;&#20126;&#22826;&#22320;&#21312;&#65292;&#28192;&#28858;&#20126;&#22826;&#22320;&#21312;&#31995;&#21015;&#26371;&#35696;&#65293;&#12300;&#38651;&#33126;&#25945;&#32946;&#25033;&#29992;&#22283;&#38555;&#26371;&#35696;&#12301;(ICCE)&#30340;&#21109;&#36774;&#20154;&#20043;&#19968;&#65292;&#35442;&#26371;&#35696;&#24050;&#25104;&#28858;&#20126;&#22826;&#22320;&#21312;&#26368;&#26377;&#32882;&#26395;&#30340;&#24180;&#24230;&#26371;&#35696;&#65292;&#20006;&#19988;&#24050;&#32147;&#22312;&#21488;&#28771;&#12289;&#26032;&#21152;&#22369;&#12289;&#39340;&#20358;&#35199;&#20126;&#12289;&#20013;&#22283;&#22823;&#38520;&#12289;&#26085;&#26412;&#12289;&#38867;&#22283;&#12289;&#32016;&#35199;&#34349;&#12289;&#39321;&#28207;&#20197;&#21450;&#28595;&#27954;&#31561;&#22320;&#33289;&#34892;&#12290;&#38500;&#27492;&#20043;&#22806;&#65292;&#28192;&#20134;&#28858;&#12300;&#20126;&#22826;&#25976;&#20301;&#23416;&#32722;&#23416;&#26371;&#12301;(APSCE, http:// http://www.apsce.net)&#21488;&#28771;&#32317;&#37096;&#30340;&#36000;&#36012;&#20154;&#65292;&#35442;&#23416;&#26371;&#36000;&#36012;&#12300;&#38651;&#33126;&#25945;&#32946;&#25033;&#29992;&#22283;&#38555;&#26371;&#35696;&#12301;(ICCE)&#21450;Research and Practice of Technology Enhanced Learning&#65288;RPTEL&#65289;&#26399;&#21002;&#12290;<br>
&#26410;&#20358;&#24840;&#20358;&#24840;&#22810;&#25976;&#20301;&#25945;&#23460;&#30340;&#20986;&#29694;&#65292;&#27161;&#35468;&#25976;&#20301;&#23416;&#32722;&#40643;&#37329;&#26178;&#20195;&#30340;&#21040;&#20358;&#12290;&#22240;&#27492;&#65292;&#38515;&#25945;&#25480;&#26368;&#36817;&#20849;&#21516;&#30332;&#36215;&#19968;&#38917;&#20840;&#29699;&#21512;&#20316;&#30740;&#31350;&#32773;&#32178;&#36335;(&#35211;&#32178;&#22336;http://www.g1on1.org)&#12290;<br>
</p>
<p class="MsoNormal" style="text-align: justify; text-justify: inter-ideograph; text-indent: 24.0pt; line-height: 18.0pt; layout-grid-mode: char;">&#20182;&#26366;&#26159;ICCE1993&#12289;IEEE WMTE2004&#12289;GCCCE&#12289;CSCL2005&#21450;ITS2006&#31561;&#26371;&#35696;&#20027;&#24109;&#12290;&#26368;&#36817;&#20182;&#31820;&#36774;IEEE DIGITEL2007&#30340;&#26371;&#35696;&#65292;&#26159;&#26377;&#38364;&#36938;&#25138;&#24335;&#25976;&#20301;&#23416;&#32722;&#33287;&#26234;&#24935;&#22411;&#29609;&#20855;&#25945;&#32946;&#25033;&#29992;&#20043;&#22283;&#38555;&#26371;&#35696;&#12290;&#38515;&#24503;&#25079;&#25812;&#20219;&#22810;&#20491;&#22283;&#38555;&#33879;&#21517;&#25976;&#20301;&#23416;&#32722;&#30456;&#38364;&#26399;&#21002;&#30340;&#21103;&#20027;&#32232;&#25110;&#32232;&#36655;&#22996;&#21729;&#65292;&#20182;&#20006;&#26366;&#25812;&#20219;&#32654;&#22283;&#22283;&#23478;&#31185;&#23416;&#22996;&#21729;&#26371;&#12289;&#27472;&#30431;&#65292;&#21450;&#20126;&#27954;&#22810;&#20491;&#22283;&#23478;&#30740;&#31350;&#35336;&#30059;&#30340;&#35413;&#23529;&#12290;<br>
      <br>
      2006&#24180;7&#26376;<br>
</p>
</table>
</BODY>
</HTML>